* Demo static dynamic array
  #+begin_src C 
    #include <stdio.h>
    #include <stdlib.h>

    int main(){
      int A[5] = {2,4,6,8,10};
      int *p;
      int i;

      p=(int*)malloc(sizeof(int) * 5);
      p[0] = 3;
      p[1] = 5;
      p[2] = 7;
      p[3] = 9;
      p[4] = 11;

      for (int i = 0; i < 5 ; i++) {
	printf("%d\t%d\n", A[i], p[i]);
      }


      return 0;
    }

  #+end_src

  #+RESULTS:
  |  2 |  3 |
  |  4 |  5 |
  |  6 |  7 |
  |  8 |  9 |
  | 10 | 11 |
** demo
   #+begin_src C 
     #include <stdio.h>
     #include <stdlib.h>

     int main(){
       int *p, *q;

       p = (int*)malloc(sizeof(int) * 5);
       p[0] = 3;
       p[1] = 5;
       p[2] = 7;
       p[3] = 9;
       p[4] = 11;


       /* for (int i = 0; i < 5 ; i++) { */
       /* 	 printf("%d\n", p[i]); */
       /* } */

       q = (int*)malloc(sizeof(int) * 10);

       for (int i = 0; i < 5 ; i++) {
	 q[i] = p[i];
       }

       free(p);
       p = q;
       q = NULL;

       for (int i = 0; i < 5 ; i++) {
	 printf("%d\n", p[i]);
       }

       return 0;
     }

   #+end_src

   #+RESULTS:
   |  3 |
   |  5 |
   |  7 |
   |  9 |
   | 11 |
   |    |
